validation/conventional/scalarTransport/LES/WMLES/3D/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    crossflow
    {
        type            zeroGradient;
    }
    jet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            LOTWWallModel;
        value           uniform 0;
		RootFinder
		{
			type			Newton;
		}
		Law
		{
			type			IntegratedWernerWengle;
		}
    }
    back
    {
        type            LOTWWallModel;
        value           uniform 0;
		RootFinder
		{
			type			Newton;
		}
		Law
		{
			type			IntegratedWernerWengle;
		}
    }
    bottom
    {
        type            LOTWWallModel;
        value           uniform 0;
		RootFinder
		{
			type			Newton;
		}
		Law
		{
			type			IntegratedWernerWengle;
		}
    }
    top
    {
        type            LOTWWallModel;
        value           uniform 0;
		RootFinder
		{
			type			Newton;
		}
		Law
		{
			type			IntegratedWernerWengle;
		}
    }
    pipe
    {
        type            LOTWWallModel;
        value           uniform 0;
		RootFinder
		{
			type			Newton;
		}
		Law
		{
			type			IntegratedWernerWengle;
		}
    }
}

// ************************************************************************* //
